Revit 2027 API
BuiltInFailures.PointFailures.RegenFailure Property
 Regeneration Failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RegenFailure { get; }
Public Shared ReadOnly Property RegenFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RegenFailure {
	FailureDefinitionId^ get ();
}
static member RegenFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PointFailures Class
Autodesk.Revit.DB Namespace